<?php
$questions = ['как узнать тип переменной',
    'как получить доступ к элементу ассоциативного массива',
    'можно ли смешивать ассоциативные и индексные массивы',
    'какое максимальное число может хранить числовая переменная',
    'для чего используются обратные одинарные кавычки',
    'как вывести (экранировать) одинарные \' или двоные \" кавычки в echo'
];

$deskBook = '"Совершенный код" - Стив Макконнелл';
$phpBook = '"Самоучитель PHP7" - Кузнецов, Симдянов';
$fantasyBook = '"Ник" - Анжей Ясинский';
$funnyBook = '"Меч без имени" - Андрей Белянин';
$travelBook = '"Вокруг света за 100 дней и 100 рублей" - Дмитрий Иуанов';

?>

<pre>
    <?php print_r($questions); ?>
</pre>

